app/models/gift.rb

  def self.available
    Gift.where(employee_id: nil)
---
SELECT "gifts".* FROM "gifts" WHERE "gifts"."employee_id" IS NULL AND ('football' = ANY (categories)) ORDER BY categories DESC LIMIT $1  [["LIMIT", 1]]